myinit.org
* !!PATHS used in this file!!
** See Magit "GIT_SSH"
* Things to do outside of emacs
  Search contents for "outside of emacs"

How to notes
* Emacs daemon server
  Run command: C:\Users\chany\Documents\Programming\emacs\emacs-26.3-x86_64\bin\emacsclientw.exe -c -n -a "" -f C:\Users\chany\Documents\Programming\emacs\.emacs.d\server\server
* Emacs Windows shortcut
  Create a windows shortcut file and give it a path: C:\Users\chany\Documents\Programming\emacs\emacs-26.3-x86_64\bin\emacsclientw.exe -c -n -a ""
* Basics
** C-x z: Repeats previous command. Run in once and then subsequently press z to repeat. e.g. C-p C-x z then zzzzzz
** M-%: find & replace string. Type 'y' to replace, '!' to replace all occurences below the point.

* In the minibuffer

** M-p moves to the previous input in minibuffer history.
** M-n moves to the next input in minibuffer
** M-r searches for an input that matches the supplied regexp.

* Register
** C-x r w REG 	Command: window-configuration-to-register
   Save the window configuration of current frame into register REG
** C-x r f REG 	Command: frame-configuration-to-register
   Save the state of all frames, including all their windows, in register REG
** C-x r j REG 	Command: jump-to-register
   Jump to a register REG.
* Macros
** F3 to begin recording Macro. If recording Macro and F3 is pressed again, it will insert an incrementor startig from zero. To set a starting point, before running a macro, press M-[number] F3. This will start recording a Macro and when F3 is pressed, incrementor with that number as the initial number will begin.
** F4 to end recording Macro. If ended and pressed F4 again, it will run Macro
** C-x C-k r: run the last keyboard macro on each line that begins in the region (apply-macro-to-region-lines)
* Autocomplete
  When for example you wish to create or rename a file and autocomplete is suggesting a similar filename, press C-M-j to enter avoiding the suggestion
* How to have user directory settings without altering the environment variables
  First make a .emacs file in the system HOME directory with the following code:
#  #+BEGIN_SRC emacs-lisp
#    ;; Place this file in C:/Users/chanyoungs and point to the appropriate files
#    (setq user-init-file "C:/Users/chanyoungs/Documents/Programming/emacs/.emacs.d/init.el")
#    (setq user-emacs-directory "C:/Users/chanyoungs/Documents/Programming/emacs/.emacs.d/")
#    (setq default-directory "C:/Users/chanyoungs/Documents/Programming/")
#    (setenv "HOME" "C:/Users/chanyoungs/Documents/Programming/emacs/")
#    (load user-init-file)
#  #+END_SRC

* New-line-without-break-of-line
  #+BEGIN_SRC emacs-lisp
    ;; newline-without-break-of-line
    (defun newline-without-break-of-line ()
      "1. move to end of the line.
      2. insert newline with index"

      (interactive)
      (let ((oldpos (point)))
	(end-of-line)
	(newline-and-indent)))

    (global-set-key (kbd "<C-return>") 'newline-without-break-of-line)
  #+END_SRC

* show-parens mode
  #+BEGIN_SRC emacs-lisp
    (setq show-paren-delay 0)
    (show-paren-mode 1)
  #+END_SRC
* Interface tweaks
  #+BEGIN_SRC emacs-lisp
    (setq inhibit-startup-message t)
    (fset 'yes-or-no-p 'y-or-n-p)
    (global-set-key (kbd "<f5>") 'revert-buffer)
    (global-set-key (kbd "C-x C-b") 'ibuffer)
  #+END_SRC
** Linenumbers
   #+BEGIN_SRC emacs-lisp
     (global-linum-mode t)
   #+END_SRC

** Delete selection mode
   When typing with text highlighted, it replaces it
   #+BEGIN_SRC emacs-lisp
     (delete-selection-mode 1)
   #+END_SRC

* Try
  #+BEGIN_SRC emacs-lisp
    (use-package try
      :ensure t)

  #+END_SRC

* Which key
  Brings up some help
  #+BEGIN_SRC emacs-lisp
    (use-package which-key
      :ensure t
      :config (which-key-mode))
  #+END_SRC
  
* Org-mode
# ** Org bullets
#    For some reason, org-bullets causes org-mode and swiper to be extremely slow.
#    #+BEGIN_SRC emacs-lisp
#      (use-package org-bullets
#        :ensure t
#        :config
#        (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#    #+END_SRC

** Hide leading stars
   #+BEGIN_SRC emacs-lisp
    (setq org-hide-leading-stars t)
   #+END_SRC

** Load languages on demand
   #+BEGIN_SRC emacs-lisp
    (defadvice org-babel-execute-src-block (around load-language nil activate)
      "Load language if needed"
      (let ((language (org-element-property :language (org-element-at-point))))
	(unless (cdr (assoc (intern language) org-babel-load-languages))
	  (add-to-list 'org-babel-load-languages (cons (intern language) t))
	  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))
	ad-do-it))
   #+END_SRC
** Disable execution prompts
   #+BEGIN_SRC emacs-lisp
     (defun my-org-confirm-babel-evaluate (lang body)
       (not (string= lang "python")))  ; don't ask for python
     (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
   #+END_SRC
  
** Example code block evaluation
   Use C-c C-c to evaluate
   #+BEGIN_SRC python :results output
     print('Hello world!')
   #+END_SRC

   #+RESULTS:
   : Hello world!

* Ace-window
  #+BEGIN_SRC emacs-lisp
    (use-package ace-window
      :ensure t
      :init
    (progn
      (global-set-key [remap other-window] 'ace-window)
      (custom-set-faces
       '(aw-leading-char-face
         ((t (:inherit ace-jump-face-foreground :height 3.0)))))
      ))
  #+END_SRC

* Counsel(with yank-pop) and Swiper(counsel is dependent package)
  C-s to search then use C-p and C-n to move to search items in other lines. C-s [string] C-'(swiper-avy) can also let search in same lines.
  #+BEGIN_SRC emacs-lisp
    (use-package counsel
      :ensure t
      :bind
      (("M-y" . counsel-yank-pop)
      :map ivy-minibuffer-map
      ("M-y" . ivy-next-line)
      ))

    (use-package swiper
      :ensure t
      :config
      (progn
	(ivy-mode 1)
	(setq ivy-use-virtual-buffers t)
	(setq enable-recursive-minibuffers t)
	(global-set-key "\C-s" 'swiper)
	(global-set-key (kbd "C-c C-r") 'ivy-resume)
	(global-set-key (kbd "<f6>") 'ivy-resume)
	(global-set-key (kbd "M-x") 'counsel-M-x)
	(global-set-key (kbd "C-x C-f") 'counsel-find-file)
	(global-set-key (kbd "<f1> f") 'counsel-describe-function)
	(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
	(global-set-key (kbd "<f1> l") 'counsel-find-library)
	(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
	(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
	(global-set-key (kbd "C-c g") 'counsel-git)
	(global-set-key (kbd "C-c j") 'counsel-git-grep)
	(global-set-key (kbd "C-c k") 'counsel-ag)
	(global-set-key (kbd "C-x l") 'counsel-locate)
	(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
	(define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
	))

  #+END_SRC
* Expand-region
  C-= to expand region
  #+BEGIN_SRC emacs-lisp
    (use-package expand-region
      :ensure t
      :config
      (global-set-key (kbd "C-=") 'er/expand-region))
    (setq shift-select-mode nil) ;; When you expand region then C-g for some reason has conflict with transient-mark-mode
  #+END_SRC
  
* iedit, narrowing-widening
  C-; to iedit. Basically search and replace simultaneously
  To be used with expand-region, narrowing-widening
  #+BEGIN_SRC emacs-lisp
    (use-package iedit
      :ensure t)
  #+END_SRC
  C-x n to narrow/widen
  #+BEGIN_SRC emacs-lisp
    (define-prefix-command 'endless/toggle-map)
    ;; The manual recommends C-c for user keys, but C-x t is
    ;; always free, whereas C-c t is used by some modes.
    (define-key ctl-x-map "t" 'endless/toggle-map)
    (define-key endless/toggle-map "c" #'column-number-mode)
    (define-key endless/toggle-map "d" #'toggle-debug-on-error)
    (define-key endless/toggle-map "e" #'toggle-debug-on-error)
    (define-key endless/toggle-map "f" #'auto-fill-mode)
    (define-key endless/toggle-map "l" #'toggle-truncate-lines)
    (define-key endless/toggle-map "q" #'toggle-debug-on-quit)
    (define-key endless/toggle-map "t" #'endless/toggle-theme)
    ;;; Generalized version of `read-only-mode'.
    (define-key endless/toggle-map "r" #'dired-toggle-read-only)
    (autoload 'dired-toggle-read-only "dired" nil t)
    (define-key endless/toggle-map "w" #'whitespace-mode)

    (defun narrow-or-widen-dwim (p)
      "Widen if buffer is narrowed, narrow-dwim otherwise.
    Dwim means: region, org-src-block, org-subtree, or
    defun, whichever applies first. Narrowing to
    org-src-block actually calls `org-edit-src-code'.

    With prefix P, don't widen, just narrow even if buffer
    is already narrowed."
      (interactive "P")
      (declare (interactive-only))
      (cond ((and (buffer-narrowed-p) (not p)) (widen))
            ((region-active-p)
             (narrow-to-region (region-beginning)
                               (region-end)))
            ((derived-mode-p 'org-mode)
             ;; `org-edit-src-code' is not a real narrowing
             ;; command. Remove this first conditional if
             ;; you don't want it.
             (cond ((ignore-errors (org-edit-src-code) t)
                    (delete-other-windows))
    	       ((ignore-errors (org-narrow-to-block) t))
    	       (t (org-narrow-to-subtree))))
            ((derived-mode-p 'latex-mode)
             (LaTeX-narrow-to-environment))
            (t (narrow-to-defun))))

    (define-key endless/toggle-map "n"
      #'narrow-or-widen-dwim)
    ;; This line actually replaces Emacs' entire narrowing
    ;; keymap, that's how much I like this command. Only
    ;; copy it if that's what you want.
    (define-key ctl-x-map "n" #'narrow-or-widen-dwim)
    (add-hook 'LaTeX-mode-hook
              (lambda ()
                (define-key LaTeX-mode-map "\C-xn"
    	      nil)))
  #+END_SRC
* Auto-complete
    #+BEGIN_SRC emacs-lisp
      (use-package auto-complete
        :ensure t
        :init
        (progn
          (ac-config-default)
          (global-auto-complete-mode t)
          (add-to-list 'ac-dictionary-directories "~/.emacs.d/dict")
          ))
    #+END_SRC

