myinit.org
* Themes
    #+BEGIN_SRC emacs-lisp
      ;; (use-package color-theme
      ;;   :ensure t)

      ;; (use-package zenburn-theme
      ;;   :ensure t
      ;;   :config (load-theme 'zenburn t))

      ;; (use-package monokai-theme
      ;;   :ensure t
      ;;   :config (load-theme 'monokai t))

      ;; (use-package ample-theme
      ;;   :init (progn (load-theme 'ample t t)
      ;;     	     (load-theme 'ample-flat t t)
      ;;     	     (load-theme 'ample-light t t)
      ;;     	     (enable-theme 'ample))
      ;;   :defer t
      ;;   :ensure t

      ;; (use-package atom-one-dark-theme
      ;;   :ensure t
      ;;   :config (load-theme 'atom-one-dark t))

      ;; (use-package tangotango-theme
      ;;   :ensure t
      ;;   :config (load-theme 'tangotango t))
      (load-theme 'atom-one-dark t)
    #+END_SRC

* Reveal.js
   #+BEGIN_SRC emacs-lisp
     (setq org-reveal-mathjax t)
     (use-package ox-reveal
       :ensure ox-reveal)
     (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/"
   	)

   #+END_SRC
* smartparens
    #+BEGIN_SRC emacs-lisp
      (use-package smartparens
        :ensure t
        :config (require 'smartparens-config)
        :init (smartparens-global-mode t))
    #+END_SRC
  
* python
** path
   #+BEGIN_SRC emacs-lisp
     (setenv "PATH"
	     (concat
	      "C:/Users/chanyoungs/Anaconda2/Scripts/" ";"
	      (getenv "PATH")
	      )
	     )   
   #+END_SRC
** outside of emacs:
   Make sure that you have:
    1. pip
    2. pip install virtualenv
    [[https://www.youtube.com/watch?v=6BlTGPsjGJk][Emacs as a Python IDE - youtube]]
** Bug fix
   Warning...
   https://www.bountysource.com/issues/26370019-emacs-hangs-if-python-block-is-not-executed
   #+BEGIN_SRC emacs-lisp
     (setq python-shell-completion-native-enable nil)
     ;; (setq python-shell-prompt-detect-failure-warning nil)

     ;; (with-eval-after-load 'python
     ;;   (defun python-shell-completion-native-try ()
     ;;     "Return non-nil if can trigger native completion."
     ;;     (let ((python-shell-completion-native-enable t)
     ;;        (python-shell-completion-native-output-timeout
     ;;    	python-shell-completion-native-try-output-timeout))
     ;;    (python-shell-completion-native-get-completions
     ;;     (get-buffer-process (current-buffer))
     ;;     nil "_"))))
   #+END_SRC
** Flycheck 
*** outside of meacs:
    For Flycheck to work properly, you need the correct dlls. Easiest way is to use [[https://github.com/zklhp/emacs-w64/releases][emacs-w64]]
    If you get "libxml2 library not found" error, copy and paste the libxml2.dll file in the bin folder of your emacs(files are in emacs.d)
    for some reason, the actual files seem to be these 2 files: "zlib1.dll" & "libiconv-2.dll"
    https://emacs.stackexchange.com/questions/3874/easiest-way-to-install-emacs-windows-support-libraries
    https://sourceforge.net/projects/emacsbinw64/

*** emacs-lisp:
    #+BEGIN_SRC emacs-lisp
      (use-package flycheck
        :ensure t
        :init
        (global-flycheck-mode t))
    #+END_SRC
** Jedi
    #+BEGIN_SRC emacs-lisp
      (use-package jedi
	:ensure t
	:init
	(add-hook 'python-mode-hook 'jedi:setup)
	(add-hook 'python-mode-hook 'jedi:ac-setup))
	;; (remove-hook 'python-mode-hook 'ac-modes)
    #+END_SRC

** exec-path-from-shell
    #+BEGIN_SRC emacs-lisp
      (use-package exec-path-from-shell
        :ensure t)
    #+END_SRC

** Projectile
     #+BEGIN_SRC emacs-lisp
       (use-package projectile
         :ensure    projectile
         :config    (projectile-global-mode t)
         :diminish   projectile-mode)
     #+END_SRC

** epc
     #+BEGIN_SRC emacs-lisp
       (use-package epc
         :ensure t)
     #+END_SRC
** elpy
     #+BEGIN_SRC emacs-lisp
       (use-package elpy
         :ensure t
         :config
         (elpy-enable))
     #+END_SRC

** ein
   Emacs ipython editor
   #+BEGIN_SRC emacs-lisp
     (use-package ein
       :ensure t)
   #+END_SRC
   
   Save error hack
   #+BEGIN_SRC emacs-lisp
     ;; ;;; my hack to calls ein:notebook-save-notebook-command when in ein mode
     ;; (defun save-buffer (&optional arg)
     ;;   (interactive "p")
     ;;   (if (eq major-mode 'ein:notebook-multilang-mode)
     ;;       (ein:notebook-save-notebook-command)
     ;;     (let ((modp (buffer-modified-p))
     ;; 	  (make-backup-files (or (and make-backup-files (not (eq arg 0)))
     ;; 				 (memq arg '(16 64)))))
     ;;       (and modp (memq arg '(16 64)) (setq buffer-backed-up nil))
     ;;       (if (and modp (buffer-file-name))
     ;; 	  (message "Saving file %s..." (buffer-file-name)))
     ;;       (basic-save-buffer)
     ;;       (and modp (memq arg '(4 64)) (setq buffer-backed-up nil)))))

     ;; ;;; advice /defadvice that fails
     ;; (defun save-ein()
     ;;   (if (eq major-mode 'ein:notebook-multilang-mode)
     ;;       (ein:notebook-save-notebook-command))))
     ;; (advice-add 'save-buffer :before #'save-ein)
   #+END_SRC
     
** conda
     #+BEGIN_SRC emacs-lisp
       (use-package conda
	 :ensure t)
       (custom-set-variables
	'(conda-anaconda-home "C:/Users/chanyoungs/Anaconda2"))
     #+END_SRC
* yasnippet
   #+BEGIN_SRC emacs-lisp
     (use-package yasnippet
       :ensure t
       :init
       (yas-global-mode 1)
       )

   #+END_SRC

* auto-yasnippet
   #+BEGIN_SRC emacs-lisp
     (use-package auto-yasnippet
       :ensure t)
     (global-set-key (kbd "C-c y c") #'aya-create)
     (global-set-key (kbd "C-c y e") #'aya-expand)
     (global-set-key (kbd "C-o") #'aya-open-line)
   #+END_SRC

* Javascript
** outside of emacs
   If you get "libxml2 library not found" error, copy and paste the libxml2.dll file in the bin folder of your emacs(files are in emacs.d)
   for some reason, the actual files seem to be these 2 files: "zlib1.dll" & "libiconv-2.dll"
   https://emacs.stackexchange.com/questions/3874/easiest-way-to-install-emacs-windows-support-libraries
   https://sourceforge.net/projects/emacsbinw64/
** hide codeblocks
     #+BEGIN_SRC emacs-lisp
       (add-hook 'js-mode-hook
                 (lambda ()
                   ;; Scan the file for nested code blocks
                   (imenu-add-menubar-index)
                   ;; Activate the folding mode
                   (hs-minor-mode t)))
     #+END_SRC
** js2-mode
     #+BEGIN_SRC emacs-lisp
       (use-package js2-mode
         :mode "\\.js\\'"
         :commands js2-mode
         :config
         (setq-default
          js2-auto-indent-flag nil
          js2-basic-offset 4
          js2-electric-keys nil
          js2-enter-indents-newline nil
          js2-mirror-mode nil
          js2-mode-show-parse-errors nil
          js2-mode-show-strict-warnings nil
          js2-mode-squeeze-spaces t
          js2-strict-missing-semi-warning nil
          js2-strict-trailing-comma-warning nil
          js2-bounce-indent-p t
          js2-global-externs (list "$" "ko" "_")
          js2-highlight-external-variables t
          js2-mode-show-parse-errors t
          js2-mode-show-strict-warnings t)
         (add-hook 'js2-mode-hook 'flycheck-mode))
     #+END_SRC
** simple-httpd
     #+BEGIN_SRC emacs-lisp
       (use-package simple-httpd
         :ensure t)
     #+END_SRC
** skewer mode
     #+BEGIN_SRC emacs-lisp
       ;; (use-package skewer-mode
       ;;   :ensure t)
       ;; (add-hook 'js2-mode-hook 'skewer-mode)
       ;; (add-hook 'css-mode-hook 'skewer-css-mode)
       ;; (add-hook 'html-mode-hook 'skewer-html-mode)
     #+END_SRC
** impatient mode
     #+BEGIN_SRC emacs-lisp
       (use-package impatient-mode
         :ensure t)
      #+END_SRC
** typescript mode
     #+BEGIN_SRC emacs-lisp
       (use-package typescript-mode
	 :ensure t)
      #+END_SRC

** webmode
     #+BEGIN_SRC emacs-lisp
       (use-package web-mode
	 :ensure t)


       (add-to-list 'auto-mode-alist '("/project/dir/.*\\.js\\'" . web-mode))
       (setq web-mode-content-types-alist
	     '(("jsx"  . "/project/dir/.*\\.js[x]?\\'")))
       (add-to-list 'auto-mode-alist '("\\.jsx$" . web-mode))

       (add-to-list 'auto-mode-alist '("\\.tsx\\'" . web-mode))
       (add-hook 'web-mode-hook
		 (lambda ()
		   (when (string-equal "tsx" (file-name-extension buffer-file-name))
		     (setup-tide-mode))))

       ;; disable jshint since we prefer eslint checking
       (setq-default flycheck-disabled-checkers
		     (append flycheck-disabled-checkers
			     '(javascript-jshint)))

       ;; use eslint with web-mode for jsx files
       (flycheck-add-mode 'javascript-eslint 'web-mode)
       (flycheck-add-mode 'javascript-eslint 'javascript-mode)
      #+END_SRC
   
** reactmode
     #+BEGIN_SRC emacs-lisp
       (use-package rjsx-mode
	 :ensure t)
       (add-to-list 'auto-mode-alist '("components\\/.*\\.js\\'" . rjsx-mode))
       (add-to-list 'auto-mode-alist '("\\.tsx\\'" . rjsx-mode))
       (flycheck-add-mode 'javascript-eslint 'rjsx-mode)
     #+END_SRC
   
* nameses
  <f9> ¡ú Load an existing session
  Ctrl-u <f9> ¡ú Create new session (you¡¯ll be asked for a name)
  Ctrl-Shift-<f9> ¡ú Save session (you¡¯ll be asked for a name)
  Ctrl-<f9> ¡ú Switch to previous session
  #+BEGIN_SRC emacs-lisp
    (load "nameses")
    (require 'desktop)
    (require 'nameses)
    (global-set-key (kbd "<f9>")     'nameses-load)
    (global-set-key (kbd "C-<f9>")   'nameses-prev)
    (global-set-key (kbd "C-S-<f9>") 'nameses-save)
  #+END_SRC
* magit
** outside of emacs:
*** You should install git and add git to the PATH environment variable which is roughly at C:\Users\chanyoungs\AppData\Local\GitHub\PortableGit_f02737a78695063deace08e96d5042710d3e32db\cmd\
*** You should make sure that sh.exe is also added to the PATH environment variable at C:\Users\chanyoungs\AppData\Local\GitHub\PortableGit_f02737a78695063deace08e96d5042710d3e32db\usr\bin\
*** You should have repositories at ssh as opposed to https https://help.github.com/articles/changing-a-remote-s-url/
*** Best to install and use Putty to avoid password insertion which seems to cause problems on Windows http://guides.beanstalkapp.com/version-control/git-on-windows.html
