myinit.el

;; (use-package color-theme
;;   :ensure t)

;; (use-package zenburn-theme
;;   :ensure t
;;   :config (load-theme 'zenburn t))

;; (use-package monokai-theme
;;   :ensure t
;;   :config (load-theme 'monokai t))

;; (use-package ample-theme
;;   :init (progn (load-theme 'ample t t)
;;     	     (load-theme 'ample-flat t t)
;;     	     (load-theme 'ample-light t t)
;;     	     (enable-theme 'ample))
;;   :defer t
;;   :ensure t

;; (use-package atom-one-dark-theme
;;   :ensure t
;;   :config (load-theme 'atom-one-dark t))

;; (use-package tangotango-theme
;;   :ensure t
;;   :config (load-theme 'tangotango t))
(load-theme 'atom-one-dark t)

(setq org-reveal-mathjax t)
(use-package ox-reveal
  :ensure ox-reveal)
(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/"
   )

(use-package smartparens
  :ensure t
  :config (require 'smartparens-config)
  :init (smartparens-global-mode t))

(setenv "PATH"
	(concat
	 "C:/Users/chanyoungs/Anaconda2/Scripts/" ";"
	 (getenv "PATH")
	 )
	)

(setq python-shell-completion-native-enable nil)
;; (setq python-shell-prompt-detect-failure-warning nil)

;; (with-eval-after-load 'python
;;   (defun python-shell-completion-native-try ()
;;     "Return non-nil if can trigger native completion."
;;     (let ((python-shell-completion-native-enable t)
;;        (python-shell-completion-native-output-timeout
;;    	python-shell-completion-native-try-output-timeout))
;;    (python-shell-completion-native-get-completions
;;     (get-buffer-process (current-buffer))
;;     nil "_"))))

(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode t))

(use-package jedi
  :ensure t
  :init
  (add-hook 'python-mode-hook 'jedi:setup)
  (add-hook 'python-mode-hook 'jedi:ac-setup))
  ;; (remove-hook 'python-mode-hook 'ac-modes)

(use-package exec-path-from-shell
  :ensure t)

(use-package projectile
  :ensure    projectile
  :config    (projectile-global-mode t)
  :diminish   projectile-mode)

(use-package epc
  :ensure t)

(use-package elpy
  :ensure t
  :config
  (elpy-enable))

(use-package ein
  :ensure t)

;; ;;; my hack to calls ein:notebook-save-notebook-command when in ein mode
;; (defun save-buffer (&optional arg)
;;   (interactive "p")
;;   (if (eq major-mode 'ein:notebook-multilang-mode)
;;       (ein:notebook-save-notebook-command)
;;     (let ((modp (buffer-modified-p))
;; 	  (make-backup-files (or (and make-backup-files (not (eq arg 0)))
;; 				 (memq arg '(16 64)))))
;;       (and modp (memq arg '(16 64)) (setq buffer-backed-up nil))
;;       (if (and modp (buffer-file-name))
;; 	  (message "Saving file %s..." (buffer-file-name)))
;;       (basic-save-buffer)
;;       (and modp (memq arg '(4 64)) (setq buffer-backed-up nil)))))

;; ;;; advice /defadvice that fails
;; (defun save-ein()
;;   (if (eq major-mode 'ein:notebook-multilang-mode)
;;       (ein:notebook-save-notebook-command))))
;; (advice-add 'save-buffer :before #'save-ein)

(use-package conda
  :ensure t)
(custom-set-variables
 '(conda-anaconda-home "C:/Users/chanyoungs/Anaconda2"))

(use-package yasnippet
  :ensure t
  :init
  (yas-global-mode 1)
  )

(use-package auto-yasnippet
  :ensure t)
(global-set-key (kbd "C-c y c") #'aya-create)
(global-set-key (kbd "C-c y e") #'aya-expand)
(global-set-key (kbd "C-o") #'aya-open-line)

(add-hook 'js-mode-hook
          (lambda ()
            ;; Scan the file for nested code blocks
            (imenu-add-menubar-index)
            ;; Activate the folding mode
            (hs-minor-mode t)))

(use-package js2-mode
  :mode "\\.js\\'"
  :commands js2-mode
  :config
  (setq-default
   js2-auto-indent-flag nil
   js2-basic-offset 4
   js2-electric-keys nil
   js2-enter-indents-newline nil
   js2-mirror-mode nil
   js2-mode-show-parse-errors nil
   js2-mode-show-strict-warnings nil
   js2-mode-squeeze-spaces t
   js2-strict-missing-semi-warning nil
   js2-strict-trailing-comma-warning nil
   js2-bounce-indent-p t
   js2-global-externs (list "$" "ko" "_")
   js2-highlight-external-variables t
   js2-mode-show-parse-errors t
   js2-mode-show-strict-warnings t)
  (add-hook 'js2-mode-hook 'flycheck-mode))

(use-package simple-httpd
  :ensure t)

;; (use-package skewer-mode
;;   :ensure t)
;; (add-hook 'js2-mode-hook 'skewer-mode)
;; (add-hook 'css-mode-hook 'skewer-css-mode)
;; (add-hook 'html-mode-hook 'skewer-html-mode)

(use-package impatient-mode
  :ensure t)

(use-package typescript-mode
  :ensure t)

(use-package web-mode
  :ensure t)


(add-to-list 'auto-mode-alist '("/project/dir/.*\\.js\\'" . web-mode))
(setq web-mode-content-types-alist
      '(("jsx"  . "/project/dir/.*\\.js[x]?\\'")))
(add-to-list 'auto-mode-alist '("\\.jsx$" . web-mode))

(add-to-list 'auto-mode-alist '("\\.tsx\\'" . web-mode))
(add-hook 'web-mode-hook
	  (lambda ()
	    (when (string-equal "tsx" (file-name-extension buffer-file-name))
	      (setup-tide-mode))))

;; disable jshint since we prefer eslint checking
(setq-default flycheck-disabled-checkers
	      (append flycheck-disabled-checkers
		      '(javascript-jshint)))

;; use eslint with web-mode for jsx files
(flycheck-add-mode 'javascript-eslint 'web-mode)
(flycheck-add-mode 'javascript-eslint 'javascript-mode)

(use-package rjsx-mode
  :ensure t)
(add-to-list 'auto-mode-alist '("components\\/.*\\.js\\'" . rjsx-mode))
(add-to-list 'auto-mode-alist '("\\.tsx\\'" . rjsx-mode))
(flycheck-add-mode 'javascript-eslint 'rjsx-mode)

(load "nameses")
(require 'desktop)
(require 'nameses)
(global-set-key (kbd "<f9>")     'nameses-load)
(global-set-key (kbd "C-<f9>")   'nameses-prev)
(global-set-key (kbd "C-S-<f9>") 'nameses-save)
