myinit.org
** Magit instructions
   Getting started with Magit is really easy:
  
   M-x magit-status to see git status, and in the status buffer:
   s to stage files
   c c to commit (type the message then C-c C-c to actually commit)
   b b to switch to another branch
   Other handy keys:
  
   P u to do a git push
   F u to do a git pull
   try to press TAB
** Emacs-lisp
  #+BEGIN_SRC emacs-lisp
    (use-package magit
      :ensure t)
    (global-set-key (kbd "C-x g") 'magit-status)
    (setenv "GIT_SSH" "C:/Program Files/PuTTY/plink.exe")
  #+END_SRC
* undo-tree
  C-/ to undo, C-S-/ to redo
  C-x u to run undo tree, d in undo-tree to see diffs
  
  #+BEGIN_SRC emacs-lisp
    (use-package undo-tree
         :ensure t
         :init
         (global-undo-tree-mode))
  #+END_SRC
* Highlight line & Beacon mode
  #+BEGIN_SRC emacs-lisp
    (global-hl-line-mode t)
  #+END_SRC

  #+BEGIN_SRC emacs-lisp
    (use-package beacon
      :ensure t
      :config
      (beacon-mode 1)
      (setq beacon-color "#666600")
      )
  #+END_SRC
* Highlight-indentation-mode
  #+BEGIN_SRC emacs-lisp
  (set-face-background 'highlight-indentation-face "gray20")
  (set-face-background 'highlight-indentation-current-column-face "dark red")
  #+END_SRC
* Browse-url-dwim
  C-c b (mnemonic: b for browse)
  or select some text and press C-c g (mnemonic: g for Google)
  #+BEGIN_SRC emacs-lisp
    (use-package browse-url-dwim
      :ensure t)
    (require 'browse-url-dwim)

    (browse-url-dwim-mode 1)

    ;; place the cursor on a URL
    ;; press "C-c b"

    ;; select some text
    ;; press "C-c g"

    ;; to turn off confirmations
    (setq browse-url-dwim-always-confirm-extraction nil)

    ;; set specific browser to open links
    (setq browse-url-browser-function 'browse-url-default-windows-browser)
  #+END_SRC

* ac-math
  #+BEGIN_SRC emacs-lisp
    (use-package ac-math
      :ensure t
      )
  #+END_SRC
* dtrt-indent
  #+BEGIN_SRC emacs-lisp
    (use-package dtrt-indent
      :ensure t)
  #+END_SRC
* prettier
  #+BEGIN_SRC emacs-lisp
    (use-package prettier-js
      :ensure t)
    (add-hook 'js2-mode-hook 'prettier-js-mode)
    (add-hook 'web-mode-hook 'prettier-js-mode)
    (add-hook 'rjsx-mode-hook 'prettier-js-mode)
  #+END_SRC
* typescript(tide)
  #+BEGIN_SRC emacs-lisp
		(use-package tide
			:ensure t
			:after (typescript-mode company flycheck)
			:hook ((typescript-mode . tide-setup)
						 (typescript-mode . tide-hl-identifier-mode)
						 (before-save . tide-format-before-save)))

		(add-hook 'rjsx-mode-hook 'tide-mode)
  #+END_SRC
* Atomic Chrome
  #+BEGIN_SRC emacs-lisp
    (use-package atomic-chrome
      :ensure t
      :config
      (atomic-chrome-start-server))
  #+END_SRC
