myinit.el

(use-package magit
  :ensure t)
(global-set-key (kbd "C-x g") 'magit-status)
(setenv "GIT_SSH" "C:/Program Files/PuTTY/plink.exe")

(use-package undo-tree
     :ensure t
     :init
     (global-undo-tree-mode))

(global-hl-line-mode t)

(use-package beacon
  :ensure t
  :config
  (beacon-mode 1)
  (setq beacon-color "#666600")
  )

(set-face-background 'highlight-indentation-face "gray20")
(set-face-background 'highlight-indentation-current-column-face "dark red")

(use-package browse-url-dwim
  :ensure t)
(require 'browse-url-dwim)

(browse-url-dwim-mode 1)

;; place the cursor on a URL
;; press "C-c b"

;; select some text
;; press "C-c g"

;; to turn off confirmations
(setq browse-url-dwim-always-confirm-extraction nil)

;; set specific browser to open links
(setq browse-url-browser-function 'browse-url-default-windows-browser)

(use-package ac-math
  :ensure t
  )

(use-package dtrt-indent
  :ensure t)

(use-package prettier-js
  :ensure t)
(add-hook 'js2-mode-hook 'prettier-js-mode)
(add-hook 'web-mode-hook 'prettier-js-mode)
(add-hook 'rjsx-mode-hook 'prettier-js-mode)

(use-package tide
	:ensure t
	:after (typescript-mode company flycheck)
	:hook ((typescript-mode . tide-setup)
				 (typescript-mode . tide-hl-identifier-mode)
				 (before-save . tide-format-before-save)))

(add-hook 'rjsx-mode-hook 'tide-mode)
